Revit 2027 API
RoutingConditions Constructor
 Constructs a new instance of a RoutingConditions object with an indicated error level for conditions that do not meet any routing preference rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingConditions(
	RoutingPreferenceErrorLevel errorLevel
)
Public Sub New (
	errorLevel As RoutingPreferenceErrorLevel
)
public:
RoutingConditions(
	RoutingPreferenceErrorLevel errorLevel
)
new :
        errorLevel : RoutingPreferenceErrorLevel -> RoutingConditions
Parameters
errorLevel RoutingPreferenceErrorLevel
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingConditions Class
Autodesk.Revit.DB Namespace